In [ ]:
import pandas as pd

In [3]:
pd.__version__

'2.3.2'

In [5]:
data =  pd.read_csv('datasets/groupdata.csv')

In [6]:
#1. View basic rows
# Q1: How do you select the first 10 rows of the dataframe?
data.head(10)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0

In [7]:
# 2. Select specific columns
# Q2: Select only the columns:

data[['name', 'age', 'group']]

         name  age    group
0        Rauf   52  group C
1        Arif   51  group A
2     Shaista   35  group B
3      Hadeed   20  group A
4        Zara   40  group D
5       Mohid   16  group C
6       Zobia   40  group B
7      Idrees   51  group D
8       Jamil   53  group C
9      Shahid   38  group D
10    Khurram   35  group B
11       Maaz   25  group C
12    Mujahid   18  group D
13       Sara   28  group A
14     Fatima   33  group C
15  Kakamanna   42  group A

In [20]:
# Filter rows
# Q3: Select all students who are in group A.

data[data.group == 'group A']

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [31]:
# 4. Conditional filtering
# Q4: Select all students with age > 40.
data.loc[(data.age>40), ['name', 'age']]

         name  age
0        Rauf   52
1        Arif   51
7      Idrees   51
8       Jamil   53
15  Kakamanna   42

In [38]:
# 5. Multiple conditions
# Q5: Select all Female students in group B.

data[(data.gender == 'Female' ) & (data.group == 'group B')]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0

In [39]:
data.loc[data.session == 'MORNING' ,  ['name', 'session', 'scholarship']]

       name  session  scholarship
0      Rauf  MORNING       5000.0
5     Mohid  MORNING          NaN
7    Idrees  MORNING       8000.0
12  Mujahid  MORNING       7000.0

In [41]:
# 7. Using .iloc[]
# Q7: Using .iloc, return rows 5 to 10 and columns 3 to 6.
data.iloc[[5,10],[3,6]]

      address  gender
5      Lahore  Female
10  Islamabad    Male

In [43]:
data.sort_values(  by='subj1')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0

In [49]:
data.loc[(data.subj1>data.subj2), ['name' , 'subj1' ,  'subj2'] ]

         name  subj1  subj2
1        Arif   70.5   60.5
7      Idrees   84.1   76.0
8       Jamil   90.5   81.3
9      Shahid   90.5   81.3
10    Khurram   90.5   81.3
11       Maaz   90.5   81.3
13       Sara   84.1   76.0
14     Fatima   90.5   81.3
15  Kakamanna   90.5   81.3

In [52]:
data.set_index(keys = 'roll no')

,name,age,address,session,group,gender,subj1,subj2,scholarship
roll no,,,,,,,,,
MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [56]:
#Select all students who:
# are Male
# AND their session is AFTERNOON or AFT

data[(data.gender == 'Male') & (data['session'].isin(['AFTERNOON', 'AFT']))]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

In [71]:
##Filter using .isin()
# Select all students whose group is in:
# ['group A', 'group C']

# Assuming 'name' should be checked for not-null values
data.loc[data['group'].isin(['group A', 'group C']), ['group' , 'name' ]]

      group       name
0   group C       Rauf
1   group A       Arif
3   group A     Hadeed
5   group C      Mohid
8   group C      Jamil
11  group C       Maaz
13  group A       Sara
14  group C     Fatima
15  group A  Kakamanna

In [32]:
import pandas as pd
data =  pd.read_csv('datasets/groupdata.csv')
data.loc[data.address.str.contains('Lahore'), :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0

In [33]:
data['session'].replace('AFTERNOON', 'AFT')

data.loc[:,['session', 'name']]

      session       name
0     MORNING       Rauf
1         AFT       Arif
2   AFTERNOON    Shaista
3         MOR     Hadeed
4         AFT       Zara
5     MORNING      Mohid
6         AFT      Zobia
7     MORNING     Idrees
8         AFT      Jamil
9   AFTERNOON     Shahid
10        MOR    Khurram
11  AFTERNOON       Maaz
12    MORNING    Mujahid
13  AFTERNOON       Sara
14        AFT     Fatima
15  AFTERNOON  Kakamanna

In [4]:
import pandas as pd

data =  pd.read_csv('datasets/groupdata.csv')
data['pass/fail'] = data.apply(lambda row : 'pass' if ((row['subj1']+row['subj2'])/2)>80 else 'fail' , axis=1)

In [5]:
#xxxxxxxxxxxxxx###############################Lambda functions
data

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,pass/fail
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0,pass
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,fail
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,fail
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,pass
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0,fail
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN,fail
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0,fail
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0,pass
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0,pass
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,pass
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,pass
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN,pass
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,fail
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,pass
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0,pass
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0,pass

In [11]:
data.sort_values('scholarship', ascending = False).head(5)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,pass/fail
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0,fail
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0,pass
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0,pass
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0,fail
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0,fail